Table of Contents
 Class BimPluginCommandEvent
Namespace
IdeaStatiCa.BimApiLink.Plugin
Assembly
IdeaStatiCa.BimApiLink.dll
BIM - plugin command executed event
public class BimPluginCommandEvent : IdeaUserEventImplementation, IIdeaUserEvent
Inheritance
object
IdeaUserEventImplementation
BimPluginCommandEvent
Implements
IIdeaUserEvent
Inherited Members
 IdeaUserEventImplementation.EventCategory
 IdeaUserEventImplementation.EventName
 IdeaUserEventImplementation.EventAction
 IdeaUserEventImplementation.EventLabel
 IdeaUserEventImplementation.EventValue
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 BimPluginCommandEvent(string, string, int)
public BimPluginCommandEvent(string commandName, string eventLabel = null, int eventValue = 0)
Parameters
commandName string
eventLabel string
eventValue int
 Edit this page